js_chores_project_backend/app/controllers/chores_controller.rb

    def index
        chores = Chore.all
---
SELECT "chores".* FROM "chores"

    def show
        chore = Chore.find(params[:id])
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

    def create
        chore = Chore.new(chore_params)
        if chore.save
---
INSERT INTO "chores" ("task", "duration", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["task", "Mow the Lawn"], ["duration", 20], ["user_id", 54], ["created_at", "2020-10-08 16:44:50.861098"], ["updated_at", "2020-10-08 16:44:50.861098"]]

    def destroy
        chore = Chore.find_by(id: params[:id])
        chore.destroy
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "chores" WHERE "chores"."id" = ?  [["id", 20]]