js_chores_project_backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chris"], ["created_at", "2020-10-03 20:10:49.631861"], ["updated_at", "2020-10-03 20:10:49.631861"]]
---
    def create
        user = User.new(user_params)
        if user.save